Public Attributes | List of all members
API_IFCPropertyListValue Struct Reference
Element Manager
IFC property with a list of values. More...
#include <APIdefs_Properties.h>
 Public Attributes
 GS::Array< API_IFCPropertyValue >  | listValues
Values of the property.
Detailed Description
IFC property with a list of values.
Remarks
This structure contains the list of values of an IfcPropertyListValue. At least one value shall be set. All values shall have the same type.